# Использование более специфичного тега базового образа для обеспечения большей консистенции
FROM python:3.12.0

# Задание рабочей директории в контейнере
WORKDIR /app

# Сначала копирование файла с зависимостями для использования кэша Docker при сборке
COPY requirements.txt ./

# Установка зависимостей из файла, используя флаг --no-cache-dir для уменьшения размера образа
# Используем виртуальную среду для изоляции и обеспечения безопасности
RUN python -m venv /venv \
    && . /venv/bin/activate \
    && pip install --no-cache-dir -r requirements.txt

# Копирование остальных файлов проекта в /app
COPY . .

# Указываем контейнеру слушать порт 8000 (пример для веб-приложений, измените если нужен другой порт)
EXPOSE 8000

# CMD запускает приложение в контейнере
# Теперь мы запускаем python из виртуальной среды
CMD ["/venv/bin/python", "main.py"]